Revit 2017 API
DatumPlane.SetDatumExtentType Method
 Sets whether or not the end of the datum plane is aligned with 3D extents or is set to vary specifically in the indicated view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2016
Syntax
C#
public void SetDatumExtentType(
	DatumEnds datumEnd,
	View view,
	DatumExtentType extentMode
)
Visual Basic
Public Sub SetDatumExtentType ( _
	datumEnd As DatumEnds, _
	view As View, _
	extentMode As DatumExtentType _
)
Visual C++
public:
void SetDatumExtentType(
	DatumEnds datumEnd,
	View^ view,
	DatumExtentType extentMode
)
Parameters
datumEnd
Type: Autodesk.Revit.DB.DatumEnds
 Specifies one end of the datum plane in the view.
view
Type: Autodesk.Revit.DB.View
 The view in which to evaluate the datum extent settings.
extentMode
Type: Autodesk.Revit.DB.DatumExtentType
 The DatumExtentType.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The datum plane cannot be visible in the view.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
DatumPlane Class
Autodesk.Revit.DB Namespace